In [4]:
import pandas as pd
import numpy as np

# Data Frames

### List

In [6]:
data = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia',  2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340],
]

columns = [
    'Manufacture', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
    'Transmission Type', 'Vehicle_Style', 'Retail_Price'
]

### Initial load - List

In [11]:
df = pd.DataFrame(data, columns=columns)
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Dictionary

In [2]:
data = [
    {
        "Manufacture": "Nissan",
        "Model": "Stanza",
        "Year": 1991,
        "Engine HP": 138.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "sedan",
        "Retail_Price": 2000
    },
    {
        "Manufacture": "Hyundai",
        "Model": "Sonata",
        "Year": 2017,
        "Engine HP": None,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "Sedan",
        "Retail_Price": 27150
    },
    {
        "Manufacture": "Lotus",
        "Model": "Elise",
        "Year": 2010,
        "Engine HP": 218.0,
        "Engine Cylinders": 4,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "convertible",
        "Retail_Price": 54990
    },
    {
        "Manufacture": "GMC",
        "Model": "Acadia",
        "Year": 2017,
        "Engine HP": 194.0,
        "Engine Cylinders": 4,
        "Transmission Type": "AUTOMATIC",
        "Vehicle_Style": "4dr SUV",
        "Retail_Price": 34450
    },
    {
        "Manufacture": "Nissan",
        "Model": "Frontier",
        "Year": 2017,
        "Engine HP": 261.0,
        "Engine Cylinders": 6,
        "Transmission Type": "MANUAL",
        "Vehicle_Style": "Pickup",
        "Retail_Price": 32340
    }
]

### Initial load - Dict

In [5]:
df = pd.DataFrame(data)
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Showing limit rows

In [17]:
df.head(n=2)

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

<br>

# Series

### Call Columns aka Series

In [18]:
df.Manufacture

0     Nissan
1    Hyundai
2      Lotus
3        GMC
4     Nissan
Name: Manufacture, dtype: object

In [20]:
df['Engine HP']

0    138.0
1      NaN
2    218.0
3    194.0
4    261.0
Name: Engine HP, dtype: float64

In [21]:
col_name = 'Transmission Type'
df[col_name]

0       MANUAL
1    AUTOMATIC
2       MANUAL
3    AUTOMATIC
4       MANUAL
Name: Transmission Type, dtype: object

In [23]:
df[['Manufacture', 'Vehicle_Style', 'Retail_Price']]

  Manufacture Vehicle_Style  Retail_Price
0      Nissan         sedan          2000
1     Hyundai         Sedan         27150
2       Lotus   convertible         54990
3         GMC       4dr SUV         34450
4      Nissan        Pickup         32340

### Adding column

In [24]:
df['id'] = [1, 2 , 3 , 4 ,5]
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price,id
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

### Deleting column

In [26]:
del df['id']
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

<br>

# Index

In [27]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
df.Manufacture.index

RangeIndex(start=0, stop=5, step=1)

In [29]:
df.columns

Index(['Manufacture', 'Model', 'Year', 'Engine HP', 'Engine Cylinders',
       'Transmission Type', 'Vehicle_Style', 'Retail_Price'],
      dtype='object')

In [33]:
df.index = ['a','b','c','d','e']
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
a,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
c,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
d,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Accessing row

In [34]:
df.iloc[0]

Manufacture          Nissan
Model                Stanza
Year                   1991
Engine HP             138.0
Engine Cylinders          4
Transmission Type    MANUAL
Vehicle_Style         sedan
Retail_Price           2000
Name: a, dtype: object

### Accessing element

In [35]:
df.iloc[[1,4]]

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
b,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
e,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

### Reset index

In [39]:
df = df.reset_index(drop=True)
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

<br>

# Element-Wise Operations

In [40]:
df['Retail_Price'] / 100

0     20.0
1    271.5
2    549.9
3    344.5
4    323.4
Name: Retail_Price, dtype: float64

In [42]:
df['Year'] >= 2011

0    False
1     True
2    False
3     True
4     True
Name: Year, dtype: bool

### Filtering

In [49]:
df[
    df['Year'] >= 2011
]

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [51]:
df[
    (df['Manufacture'] == 'Nissan') & (df['Year'] >= 2011)
]

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

<br>

# String Operations

In [56]:
df['Vehicle_Style'].str.upper().str.replace(' ', '_')

0          SEDAN
1          SEDAN
2    CONVERTIBLE
3        4DR_SUV
4         PICKUP
Name: Vehicle_Style, dtype: object

In [11]:
df['Vehicle_Style'] = df['Vehicle_Style'].str.upper().str.replace(' ', '_')
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,SEDAN,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,SEDAN,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,CONVERTIBLE,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4DR_SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,PICKUP,32340

<br>

# Summarizing Operations

In [58]:
df.Retail_Price.min()

2000

In [60]:
df.describe().round(2)

          Year  Engine HP  Engine Cylinders  Retail_Price
count     5.00       4.00              5.00          5.00
mean   2010.40     202.75              4.40      30186.00
std      11.26      51.30              0.89      18985.04
min    1991.00     138.00              4.00       2000.00
25%    2010.00     180.00              4.00      27150.00
50%    2017.00     206.00              4.00      32340.00
75%    2017.00     228.75              4.00      34450.00
max    2017.00     261.00              6.00      54990.00

### Unique values

In [62]:
df.nunique()

Manufacture          4
Model                5
Year                 3
Engine HP            4
Engine Cylinders     2
Transmission Type    2
Vehicle_Style        4
Retail_Price         5
dtype: int64

<br>

# Missing value

In [63]:
df.isnull()

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,False,False,False,False,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False

In [64]:
df.isnull().sum()

Manufacture          0
Model                0
Year                 0
Engine HP            1
Engine Cylinders     0
Transmission Type    0
Vehicle_Style        0
Retail_Price         0
dtype: int64

<br>

# Sorting and Re-ordering

In [12]:
df

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,SEDAN,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,SEDAN,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,CONVERTIBLE,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4DR_SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,PICKUP,32340

In [13]:
df.sort_values(by='Retail_Price')

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
0,Nissan,Stanza,1991,138.0,4,MANUAL,SEDAN,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,SEDAN,27150
4,Nissan,Frontier,2017,261.0,6,MANUAL,PICKUP,32340
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4DR_SUV,34450
2,Lotus,Elise,2010,218.0,4,MANUAL,CONVERTIBLE,54990

In [14]:
df.sort_values(by='Retail_Price', ascending=False)

,Manufacture,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,Retail_Price
2,Lotus,Elise,2010,218.0,4,MANUAL,CONVERTIBLE,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4DR_SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,PICKUP,32340
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,SEDAN,27150
0,Nissan,Stanza,1991,138.0,4,MANUAL,SEDAN,2000

<br>

# Grouping

```
SELECT
    Vehicle_Style,
    AVG(Retail_Price)
FROM
    cars
GROUP BY
    Vehicle_Style
```

In [65]:
df.groupby('Vehicle_Style').Retail_Price.mean()

Vehicle_Style
4DR_SUV        34450.0
CONVERTIBLE    54990.0
PICKUP         32340.0
SEDAN          14575.0
Name: Retail_Price, dtype: float64

<br>

# Convert to Dicts

In [26]:
df.to_dict(orient='records')

[{'Manufacture': 'Nissan',
  'Model': 'Stanza',
  'Year': 1991,
  'Engine HP': 138.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'SEDAN',
  'Retail_Price': 2000},
 {'Manufacture': 'Hyundai',
  'Model': 'Sonata',
  'Year': 2017,
  'Engine HP': nan,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': 'SEDAN',
  'Retail_Price': 27150},
 {'Manufacture': 'Lotus',
  'Model': 'Elise',
  'Year': 2010,
  'Engine HP': 218.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'CONVERTIBLE',
  'Retail_Price': 54990},
 {'Manufacture': 'GMC',
  'Model': 'Acadia',
  'Year': 2017,
  'Engine HP': 194.0,
  'Engine Cylinders': 4,
  'Transmission Type': 'AUTOMATIC',
  'Vehicle_Style': '4DR_SUV',
  'Retail_Price': 34450},
 {'Manufacture': 'Nissan',
  'Model': 'Frontier',
  'Year': 2017,
  'Engine HP': 261.0,
  'Engine Cylinders': 6,
  'Transmission Type': 'MANUAL',
  'Vehicle_Style': 'PICKUP',
  'Retail_Price': 32340}]